src/Documents/ЗакреплениеОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗакреплениеОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияСостоянийОборудования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИсторияСостоянийОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСостоянийОборудования</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗакрепленоЗа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Назначена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Решена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СостоянияОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРемонте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЗакреплениеОборудования/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДанныеЗаявки = УправлениеОборудованиемСервер.ПолучитьДанныеЗаявкиДляРаботыСОборудованием(Заявка);

	Если ДанныеЗаявки = Неопределено Тогда
		Сообщить("Не удалось получить данные связанной заявки.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ДанныеЗаявки.ТекущийСтатус <> Перечисления.СтатусыЗаявок.ОжидаетОборудование Тогда	
		Сообщить("Выдача оборудования возможна только по заявке в статусе ""Ожидает оборудование"".");		
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Сотрудник <> ДанныеЗаявки.Заявитель Тогда
		Сообщить("Оборудование можно закрепить только за заявителем.");			
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеЗаявки.Оборудование) И Оборудование = ДанныеЗаявки.Оборудование Тогда	
		Сообщить("Нельзя оформить выдачу проблемного оборудования. Для него необходимо использовать документ ремонта.");			
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	МоментДоДокумента = Новый Граница(МоментВремени(), ВидГраницы.Исключая);                      
	ТекущееСостояние = УправлениеОборудованиемСервер.ПолучитьТекущееСостояниеОборудования(Оборудование, МоментДоДокумента, Ссылка);
	
	Если ТекущееСостояние = Неопределено Тогда
		Сообщить("Не удалось определить текущее состояние оборудования.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ТекущееСостояние.Состояние <> Перечисления.СостоянияОборудования.НаСкладе Тогда
		Сообщить("Выбранное оборудование нельзя закрепить, поскольку оно не находится на складе.");	
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Движения.ИсторияСостоянийОборудования.Записывать = Истина;
	Движение = Движения.ИсторияСостоянийОборудования.Добавить();
	
	Движение.Период = Дата;
	Движение.Оборудование = Оборудование;
	Движение.Состояние = Перечисления.СостоянияОборудования.Используется;
	Движение.ЗакрепленоЗа = Сотрудник;
	Движение.Заявка = Заявка;
	Движение.Комментарий = СокрЛП(Комментарий);
	Движение.Оформил = Оформил;  
КонецПроцедуры   

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтоНовый() Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Оформил) Тогда
		Попытка
		Оформил = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();

		Исключение
			Сообщить("Не удалось определить сотрудника, оформляющего закрепление. " + ОписаниеОшибки());
			Отказ = Истина;
			Возврат;
		КонецПопытки; 
	
		Если Не ЗначениеЗаполнено(Оформил) Тогда
			Сообщить("Пользователь ИБ не связан с активным сотрудником.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;  
	КонецЕсли;
КонецПроцедуры
